import os
from datetime import time

# ================= КОНФИГУРАЦИЯ =================

BOT_TOKEN = os.getenv("BOT_TOKEN")
if not BOT_TOKEN:
    raise RuntimeError("BOT_TOKEN environment variable is not set")

ADMIN_IDS = [7237228038, 1027040557, 1071264428, 5301082618]
ALLOWED_THREAD_ID = 2

# ID чата/канала для логов (подставь свой)
LOG_CHAT_ID = int(os.getenv("LOG_CHAT_ID", "-1003705737660"))
# ================= РАСПИСАНИЕ =================

SCHEDULE = {
    "even": {
        "Monday": [
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Высшая математика", "room": "309А",
             "teacher": "доц. Вронский Б.М."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ЛК История России", "room": "211А",
             "teacher": "доц. Манаев А.Ю."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Математическая логика и теория алгоритмов",
             "room": "306В", "teacher": "ст.пр. Степанова Е.И."},
            {"start": time(15, 00), "end": time(16, 30), "name": "ЛК Человек и право", "room": "309А",
             "teacher": "Шевченко В.И."},
        ],
        "Tuesday": [
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Цифровые технологии в профессиональной сфере",
             "room": "309А", "teacher": "доц. Филиппов Д.М."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ПЗ Цифровые технологии в профессиональной сфере",
             "room": "8А", "teacher": "доц. Филиппов Д.М."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Физическая культура", "room": "спортзал ТА",
             "teacher": "Ковальчук Елена Сергеевна"},
            {"start": time(15, 00), "end": time(16, 30), "name": "ПЗ История России", "room": "201В",
             "teacher": "Маргасов В.С."},
        ],
        "Wednesday": [
            {"start": time(9, 50), "end": time(11, 20), "name": "ПЗ Теория и технологии программирования",
             "room": "119А", "teacher": "Енина А.А."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ЛК Теория и технологии программирования",
             "room": "18А", "teacher": "Степанов А.В"},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Иностранный язык", "room": "531Б",
             "teacher": "Ермоленко О.В."},
        ],
        "Thursday": [
            {"start": time(8, 00), "end": time(9, 30), "name": "ПЗ Высшая математика", "room": "302В",
             "teacher": "доц. Вронский Б.М."},
            {"start": time(9, 50), "end": time(11, 20), "name": "ПЗ Основы российской государственности",
             "room": "411В", "teacher": "Валуев Д.Г."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ЛК Экономическая культура и финансовая грамотность",
             "room": "411В", "teacher": "Друзин Р.В."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Экономическая культура и финансовая грамотность",
             "room": "411В", "teacher": "Друзин Р.В."},
        ],
        "Friday": [
            {"start": time(8, 00), "end": time(9, 30), "name": "ПЗ Теория и технологии программирования",
             "room": "119А", "teacher": "Енина А.А."},
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Математическая логика и теория алгоритмов",
             "room": "302В", "teacher": "Степанова Е.И."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ЛК Метрология, стандартизация и сертификация",
             "room": "301В", "teacher": "куратор группы Дементьев М.Ю."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Метрология, стандартизация и сертификация",
             "room": "301В", "teacher": "куратор группы Дементьев М.Ю."},
        ],
    },
    "odd": {
        "Monday": [
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Высшая математика", "room": "309А",
             "teacher": "доц. Вронский Б.М."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ЛК История России", "room": "211А",
             "teacher": "доц. Манаев А.Ю."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Математическая логика и теория алгоритмов",
             "room": "306В", "teacher": "ст.пр. Степанова Е.И."},
        ],
        "Tuesday": [
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Цифровые технологии в профессиональной сфере",
             "room": "309А", "teacher": "доц. Филиппов Д.М."},
            {"start": time(11, 30), "end": time(13, 00), "name": "ПЗ Цифровые технологии в профессиональной сфере",
             "room": "8А", "teacher": "доц. Филиппов Д.М."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Физическая культура", "room": "спортзал ТА",
             "teacher": "Ковальчук Елена Сергеевна"},
            {"start": time(15, 00), "end": time(16, 30), "name": "ПЗ История России", "room": "201В",
             "teacher": "Маргасов В.С."},
        ],
        "Wednesday": [
            {"start": time(8, 00), "end": time(9, 30), "name": "ПЗ Теория и технологии программирования",
             "room": "119А", "teacher": "Енина А.А."},
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Теория и технологии программирования",
             "room": "18А", "teacher": "Степанов А.В"},
            {"start": time(11, 30), "end": time(13, 00), "name": "ЛК Основы российской государственности",
             "room": "309В", "teacher": "Валуев Д.Г."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ПЗ Иностранный язык", "room": "531Б",
             "teacher": "Ермоленко О.В."},
            {"start": time(15, 00), "end": time(16, 30), "name": "ПЗ Человек и право", "room": "301В",
             "teacher": "Шевченко В.И."},
        ],
        "Thursday": [
            {"start": time(8, 00), "end": time(9, 30), "name": "ПЗ Высшая математика", "room": "309А",
             "teacher": "доц. Вронский Б.М."},
            {"start": time(9, 50), "end": time(11, 20), "name": "ПЗ Основы российской государственности",
             "room": "304А", "teacher": "Валуев Д.Г."},
        ],
        "Friday": [
            {"start": time(8, 00), "end": time(9, 30), "name": "ПЗ Теория и технологии программирования",
             "room": "119А", "teacher": "Енина А.А."},
            {"start": time(9, 50), "end": time(11, 20), "name": "ЛК Математическая логика и теория алгоритмов",
             "room": "401В", "teacher": "Степанова Е.И."},
            {"start": time(13, 20), "end": time(14, 50), "name": "ЛК Материаловедение",
             "room": "ул.Генерала Васильева,32а (завод СЭЛМА)", "teacher": "Скиданчук А.Г."},
            {"start": time(15, 00), "end": time(16, 30), "name": "ПЗ Материаловедение",
             "room": "ул.Генерала Васильева,32а (завод СЭЛМА)", "teacher": "Скиданчук А.Г."},
        ],
    }
}